### Global environment
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>
```

terraform
Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

The remote workspace is configured to work with configuration at
/infra/global relative to the target repository.

Terraform will upload the contents of the following directory,
excluding files or directories as defined by a .terraformignore file
at /home/runner/work/NoPlan/NoPlan/.terraformignore (if it is present),
in order to capture the filesystem context the remote workspace expects:
    /home/runner/work/NoPlan/NoPlan

To view this run in a browser, visit:
https://app.terraform.io/app/ThorstenSauter/NoPlan-global/runs/run-hAnjusWh3i7Ft6AM

Waiting for the plan to start...

Terraform v1.3.8
on linux_amd64
Initializing plugins and modules...
data.azurerm_client_config.current: Reading...
data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD0zYTk1YzRhOC02NmM1LTRmMGUtYjQ1MC1lOWVmM2E1NGU3MWI7b2JqZWN0SWQ9N2ZiNDg1YjYtMTY2NC00ZTg3LWI1NGQtOThkNTA4OTJmMjVjO3N1YnNjcmlwdGlvbklkPTE2ZTAxYTAwLWY4MjUtNGM5Ni04YWUyLWU2OGNiNTJjZjY1Mzt0ZW5hbnRJZD1mZmFiMzhkZi1jZGRmLTQzM2YtODU5YS02Y2ZhMTYxYTVjZWI=]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.app_configuration.azurerm_app_configuration.app_config will be created
  + resource "azurerm_app_configuration" "app_config" {
      + endpoint                   = (known after apply)
      + id                         = (known after apply)
      + local_auth_enabled         = false
      + location                   = "westeurope"
      + name                       = "appcs-noplan-global-westeurope-001"
      + primary_read_key           = (known after apply)
      + primary_write_key          = (known after apply)
      + purge_protection_enabled   = false
      + resource_group_name        = "rg-noplan-global-westeurope-001"
      + secondary_read_key         = (known after apply)
      + secondary_write_key        = (known after apply)
      + sku                        = "free"
      + soft_delete_retention_days = 7
      + tags                       = {
          + "environment" = "Global"
          + "managed-by"  = "Terraform"
          + "project"     = "NoPlan"
        }
    }

  # module.container_registry.azurerm_container_registry.acr will be created
  + resource "azurerm_container_registry" "acr" {
      + admin_enabled                 = false
      + admin_password                = (sensitive value)
      + admin_username                = (known after apply)
      + encryption                    = (known after apply)
      + export_policy_enabled         = true
      + id                            = (known after apply)
      + location                      = "westeurope"
      + login_server                  = (known after apply)
      + name                          = "acrnoplanglobalwesteurope001"
      + network_rule_bypass_option    = "AzureServices"
      + network_rule_set              = (known after apply)
      + public_network_access_enabled = true
      + resource_group_name           = "rg-noplan-global-westeurope-001"
      + retention_policy              = (known after apply)
      + sku                           = "Basic"
      + tags                          = {
          + "environment" = "Global"
          + "managed-by"  = "Terraform"
          + "project"     = "NoPlan"
        }
      + trust_policy                  = (known after apply)
      + zone_redundancy_enabled       = false
    }

  # module.monitoring.azurerm_application_insights.app_insights will be created
  + resource "azurerm_application_insights" "app_insights" {
      + app_id                                = (known after apply)
      + application_type                      = "web"
      + connection_string                     = (sensitive value)
      + daily_data_cap_in_gb                  = (known after apply)
      + daily_data_cap_notifications_disabled = (known after apply)
      + disable_ip_masking                    = false
      + force_customer_storage_for_profiler   = false
      + id                                    = (known after apply)
      + instrumentation_key                   = (sensitive value)
      + internet_ingestion_enabled            = true
      + internet_query_enabled                = true
      + local_authentication_disabled         = false
      + location                              = "westeurope"
      + name                                  = "appi-noplan-westeurope-001"
      + resource_group_name                   = "rg-noplan-global-westeurope-001"
      + retention_in_days                     = 90
      + sampling_percentage                   = 0
      + tags                                  = {
          + "environment" = "Global"
          + "managed-by"  = "Terraform"
          + "project"     = "NoPlan"
        }
      + workspace_id                          = (known after apply)
    }

  # module.monitoring.azurerm_log_analytics_workspace.logs will be created
  + resource "azurerm_log_analytics_workspace" "logs" {
      + allow_resource_only_permissions    = true
      + daily_quota_gb                     = -1
      + id                                 = (known after apply)
      + internet_ingestion_enabled         = true
      + internet_query_enabled             = true
      + local_authentication_disabled      = false
      + location                           = "westeurope"
      + name                               = "law-noplan-westeurope-001"
      + primary_shared_key                 = (sensitive value)
      + reservation_capacity_in_gb_per_day = (known after apply)
      + resource_group_name                = "rg-noplan-global-westeurope-001"
      + retention_in_days                  = 30
      + secondary_shared_key               = (sensitive value)
      + sku                                = "PerGB2018"
      + tags                               = {
          + "environment" = "Global"
          + "managed-by"  = "Terraform"
          + "project"     = "NoPlan"
        }
      + workspace_id                       = (known after apply)
    }

  # module.resource_group.azurerm_resource_group.rg will be created
  + resource "azurerm_resource_group" "rg" {
      + id       = (known after apply)
      + location = "westeurope"
      + name     = "rg-noplan-global-westeurope-001"
      + tags     = {
          + "environment" = "Global"
          + "managed-by"  = "Terraform"
          + "project"     = "NoPlan"
        }
    }

Plan: 5 to add, 0 to change, 0 to destroy.


```
</details>